{"content": "❌ The Problem\nInterview processes are slow and expensive. Companies spend over $5,000 per hire, most of which is time spent by internal recruiting teams and hiring managers interviewing candidates, and the average length for an interview process is ~30 days.\nExisting video interviewing platforms were built to solve this for companies, but their one-way interfaces and cookie-cutter questions create a disappointing candidate experience, resulting in low completion rates and a limited hiring signal.\n\nHow does Zavata offer companies the efficiency of interview automation while providing candidates with a personalized, conversational interview experience?\n\n🚀 The Solution\nThe Zavata interviewer conducts real-time video interviews with candidates, including technical screens, phone screens, system design, coding, behavioral, and more.\nUnlike interviewing your candidates manually or with an automated assessment, Zavata is:\n* Convenient: Your AI interviewer is ready to interview candidates 24/7 with unlimited capacity.\n* Candidate First: Over 90% of scheduled candidates complete their interviews with an average candidate experience rating of 4.5/5.\n* Reliable: Data-driven feedback after each interview is customized to your hiring goals so you can feel confident that you’re moving forward with the right candidates.\n* Robust: Zavata’s fairness system flags cheating based on multi-modal data, so you can trust your interviewer’s feedback.\n* Accessible: One-click integration with your ATS so you don’t need to change your workflow."}
{"content": "Here is what Harshith Vaddiparthy - the founder of Zavata has written in an application:\n\nWebsite: https://www.zavata.ai/\n\nPitch Deck: https://drive.google.com/file/d/1sunXfwzbhJMPVuAD9XHfqIBfSsna-YzM/view?usp=sharing\n\nElevator Pitch: https://www.youtube.com/watch?v=4Z_ALVtx-gs\n\nLoom Demo: https://www.loom.com/share/ca5d430f717d469abebc2bbefa65782a?sid=7a78a6b1-89d8-4da3-a956-43c0d8d5281b"}
{"content": "MATCHMAKING BETWEEN JOB SEEKERS AND EMPLOYERS\nIn 1999, for a cover story on the new millennium, Computerworld magazine asked me for predictions that might come to pass in the coming ten to twenty years. I was surprised that they were asking me, a recent college graduate who was a new product manager at Oracle, given that the other nineteen people they interviewed were titans of technology like Bill Gates and Larry Ellison. The editor in chief had attended my college graduation, where I spoke as class president; he thought it would be interesting to get a more youthful perspective in the mix.\nRegardless, I didn't want to waste the opportunity and ran with the most far-out ideas that I thought might be plausible. I talked about a future in which we would all have artificially intelligent personal agents to represent us in 'cyberspace.' The agents would purchase things for you and broker transactions, even matchmake between employers and employees (or romantic partners). Twenty-three years went by and, for the most part, my predictions didn't come to pass. Al hadn't advanced to the necessary degree.\nFast-forward to now, and this latest generation of generative Al holds the very real promise of making my predictions seem conservative. As optimistic as I was about progress in Al in 1999, what we have started to see in the early 2020s far surpasses anything that I could have imagined happening in my lifetime. Among many other things, AI, as our personal agent, will soon post, find, apply for, and even acquire jobs for us.\nTraditionally, for every job opening at our company, we write job descriptions. Today, a hiring manager must first take the time to write that job description or work alongside someone in HR to create it. Once we post a job, we typically get several hundred résumés for every opening. Then we have our talent acquisition team go through those résumés, which is incredibly tedious work. Because these screeners can realistically spend only a few seconds on each résumé, their eyes likely focus on things like name brands of previous employers, keywords in previous job titles, or degrees from well-known universities. I can imagine that sometimes they are in the mood to dig a bit deeper, but sometimes they aren't. And this is before we come to any personal biases they bring to the table. This process is likely to miss a lot of great applicants, especially those who didn't spend time at"}
{"content": "Regardless, our recruiters flag a small pool of candidates for phone screens and possibly more interviews. If they pass the thirty-minute phone screen based on the recruiter's subjective judgment, the candidate will then be interviewed by four to six team members in the function that they are applying for. Due to scheduling complexity, this takes days or weeks. It's also quite expensive: six one-hour interviews from team members who make the equivalent of one hundred dollars an hour costs us six hundred dollars, before even considering the time to prep and debrief. To avoid inconsistency, we give interviewers a framework of questions. Yet, at the end of the day, the preferences and the mood of the interviewer likely dictate where the conversation goes. Eventually, we hope to get a signal that we have found a top choice and cross our fingers that we are making a good hire. It is a similar process almost everywhere.\nThis is an imperfect process on both sides. We probably overlooked some great candidates, and it took a lot of time and energy to eventually make an offer, knowing that it may not even be a perfect match. On top of that, by its very nature the process was not completely consistent. I also wouldn't be surprised if people's personal biases tilted things for or against certain applicants based on things that were not relevant to the job.\nIf all parties had infinite time and energy, the recruiters and the hiring managers would engage in in-depth conversations with every person interested in that job. They would apply the same standard consistently and be in the same mood and have the same level of enthusiasm for every candidate. Even better, we would be able to audit this process for bias by running test candidates through it. On top of that, in an ideal world it would take hours—not days or weeks—to come to a decision.\nThis might seem unrealistic, but it may now very well be possible to approach this ideal."}
{"content": "Large language models can already streamline the standard process in fairly obvious ways. Recruiters can use them to help draft job posts and interview questions. Candidates can use them to create cover letters and résumés. This, however, is just the tip of the iceberg.\nIn the future, if you are looking for a job, an application leveraging a large language model will create an interactive résumé that communicates with the Al that has posted the job you are applying for. Instead of just submitting a résumé and a cover letter into a void, every job candidate might be able to automatically have a rich conversation with the Al recruiter, an experience that potentially gives each person a much fairer shot. You will not even have to wait for the employer's bot to schedule time with you.\nRather, the employer's recruiter bot can talk to your agent bot. This agent will have learned to represent you accurately based on your employment history and extensive interviews that it has conducted with you.\nBecause it has been with you since you were a student, and because you've given it permission to access your entire work and education history, your skill sets, your interests, and even work samples you have produced, it will ask you what you are looking for in a job and the types of roles you might like to explore. It can even help coach you to think through career and education possibilities that match your life goals. Consider it as a supercharged life coach that learns to represent you to potential employers."}
{"content": "From there, it will look for the right positions on your behalf by talking to other Al bots that have posted these jobs. As a job seeker, your Al job agent could read literally every job posting that is out there. If you are looking to switch careers but do not have the right experience that 99 percent of employers want, your AI job agent could find the 1 percent willing to give you a shot. Your Al job agent might then report back that it just talked to a thousand employers and found a number that really value the fact that you are an outsider. Imagine a generative artificial intelligence that can solicit people over LinkedIn and reply to you with opportunities.\nThese bots, in theory, can have infinite conversations with each other and eventually glean a signal about a best fit for both parties. At the end of the day, if I am the hiring manager, my Al recruiting assistant will offer me the top five to ten people it thinks I should talk to based on the simulated conversations it has had with all the candidates' AI agents.\nThis isn't limited to just screening candidates. The AI recruiting assistant will be capable of engaging with the references that the candidate has provided. Based on this, it can further refine its recommendations.\nEven during the live interview with the candidate, the Al recruiting assistant could whisper into your ear good follow-up questions or provide real-time feedback to ensure that you're interviewing as fairly and consistently as possible.\nThe job application and hiring process will become far more equitable, faster, and less resource-intensive for everyone. Each person, or at least their Al agent, gets an interview with the hiring Al. Every company gets a chance to get to know you through your AI agent. They will go through your entire job history. I can imagine a world in which the traditional résumé may no longer be relevant or useful because your AI agent will do a much better job of representing you.\nIt's worth acknowledging that this might make some people uneasy. In fact, one of the biggest fears around Al is the bias it might introduce while screening résumés or interviewing candidates. I'll be the first to admit that it will be near impossible to create a system that is free of bias. Yet I'd argue that Al will be an improvement when it can be demonstrably less biased and more consistent than the status quo, which is subjective and full of bias. Yes, we should heavily scrutinize any Al systems that claim they can assist in the recruiting process, but I also think that eventually you will have the tools that have not only made the process more inclusive and efficient but have also made it far less biased.\n\nAI Interviewer that automates scheduling and interviewing candidates making it faster and cheaper to hire great talent."}
{"content": "I was thinking about this idea just about 4 weeks ago.\n\nAnd I had to start coding and pushing to the github repo - because I like to act fast - cuz I want to move fast and break things!!\n\nAll of it has been full-time, I left my previous job at a Sequoia Funded Web3 startup - where I was the head of content - but once I got this idea - I couldn't help but go full-time on this.\n\nAI Interviewer that automatically schedules and conducts interviews of candidates."}
{"content": "I have about 1.5 lakhs in saving - and am using this to build the product - plus the Microsoft Partnership is giving me $150k of Cloud credits - which has been super helpful.\n\nAlso taking a handout from my friends to ship faster."}
{"content": "My unique strength has to be my experience with B2B AI SaaS startups - As I have successfully built and exited an AI startup for $30,000 USD in 2023. I was able to do that with a small team of 5 (mostly friends from college) in Hyderabad with little to no resources.\n\nFor the current product - Zavata.ai - we have soft launched on Theresanaiforthat.com and have already received 600+ page visits and beta testers world wide. (We are tracking this using PostHog and Microsoft Clarity)\n\nCurrently talking to 20+ Hiring Managers whom we have connected via cold email outreach and LinkedIn DMs - and have already started iterating from the feedback that we have received.\n\nAnd have closed a partnership with Microsoft where we have access to $150,000 Azure Cloud Credits to host our LLM and Software.\n\nUnique Insight:\n\n- The unique insight that I currently have that most people / candidates don't yet believe is that - in the next 4 years all first round of screening will be done using AI. Hiring Managers won't have time to ask basic questions to filter like (Are you eligible to work in US, Do you have experience with Python) - all of these repeated tasks can be clearly automated using AI Interviewer.\n\n- I am a part of multiple sub-reddits and what I've learnt is that - Candidates might not like the initial idea of an 'AI' interviewing them - but soon enough they realize that - with an AI Interviewer - all candidates who've submitted their resumes will get a chance to share their background and their expertise - which was previously not possible without Zavata's AI Interviewer"}
{"content": "Interview processes are slow and expensive. Companies spend over $5,000 per hire, most of which is time spent by internal recruiting teams and hiring managers interviewing candidates, and the average length for an interview process is ~30 days. We want to help businesses hire - faster, better and cheaper."}
{"content": "The sectors I'm interested in building is B2B AI SaaS.\n\nWhat attracts me: honestly is is not just because of the 'Hype' around AI - but I can't stop thinking about the industry use cases that LLMs can have.\n\nLike the previous startup that I've exited for $30,000 - was also an AI startup for Finance - and over the past couple years I've got a strong understanding of these sectors and built this mental model to experiment and envision the future products that can be built.\n\nI would request you to go through the current versions of the Website and Product Here:\n\nWebsite: https://www.zavata.ai/\nDashboard: https://app.zavata.ai/dashboard\nAI Interviewer: https://app.zavata.ai/candidate-interview\n\nStill a work in progress as we are still building this based on the feedback received from Pilot Testers."}
